spec/dummy/app/controllers/posts_controller.rb

  def index
    @posts = Post.all.sort_by{|p| -p.rank}
---
SELECT "posts".* FROM "posts"